INSERT INTO ambassadeurs (fullname, zone, email, phone, note, region, created_at, updated_at)
VALUES ('احمد فال الكنتي', '1', NULL, '0670860216', NULL, 'هيئة التوجيه التربوي لوادي الذهب', NOW(), NOW()),
('طارق الغراف', '2', NULL, '0666303225', NULL, 'هيئة التوجيه التربوي لوادي الذهب', NOW(), NOW()),
('احمد بطاح', '3', NULL, '0678190410', NULL, 'هيئة التوجيه التربوي لوادي الذهب', NOW(), NOW()),
('عبد العاطي بايا', '4', NULL, '0661590415', NULL, 'هيئة التوجيه التربوي لوادي الذهب', NOW(), NOW()),
('محمد بري', '5', NULL, '0662539410', NULL, 'هيئة التوجيه التربوي لوادي الذهب', NOW(), NOW()),
('خالد كليل', '6', NULL, '0662559087', NULL, 'هيئة التوجيه التربوي لوادي الذهب', NOW(), NOW()),
('باسو اوراغ', '7', NULL, '0672647673', NULL, 'هيئة التوجيه التربوي لوادي الذهب', NOW(), NOW()),
('سعاد الدبار', '8', NULL, '0672373376', NULL, 'هيئة التوجيه التربوي لوادي الذهب', NOW(), NOW());



INSERT INTO ambassadeurs (fullname, zone, email, phone, note, region, created_at, updated_at)
VALUES ('عبد العاطي بايا', 'جميع المؤسسات التعليمية بالإقليم', NULL, '0661590415','تكليف بالمديرية', 'هيئة التوجيه التربوي لأوسرد', NOW(), NOW());