-- Active: 1710095898738@@127.0.0.1@3306@academia
-- this is very private data so don't use it for something bad
















-- nothing

















-- nothing

use academia;

INSERT INTO departements (email, phone, job, name, departement, region, created_at, updated_at)
VALUES ('ahmedkourrad@gmail.com', '0662120867', 'المدير الإقليمي', 'احمد كراد', 'المسؤول الإقليمي', 'المديرية الإقليمية وادي الذهب', NOW(), NOW()),
(NULL, '0662795088', 'الكتابة الخاصة', 'عمر بوزاكا', 'المسؤول الإقليمي', 'المديرية الإقليمية وادي الذهب', NOW(), NOW()),
('ezzounktif@gmail.com', '0666342269', 'الكتابة التقنية', 'فتيحة الزونكطي', 'المسؤول الإقليمي', 'المديرية الإقليمية وادي الذهب', NOW(), NOW()),
('sk.elhafidi@gmail.com', '0666436886', 'منظومة الاعلام', 'سكينة الحافظي', 'المسؤول الإقليمي', 'المديرية الإقليمية وادي الذهب', NOW(), NOW()),
('lachguer477@gmail.com', '0662122985', 'كتابة الضبط', 'نعيمة لشكر', 'المسؤول الإقليمي', 'المديرية الإقليمية وادي الذهب', NOW(), NOW()),
(NULL, '0662780462', 'كتابة الضبط', 'فوزية ايت تمست', 'المسؤول الإقليمي', 'المديرية الإقليمية وادي الذهب', NOW(), NOW()),
(NULL, '0662760355', 'كتابة الضبط', 'مريم كركور', 'المسؤول الإقليمي', 'المديرية الإقليمية وادي الذهب', NOW(), NOW()),
(NULL, '0668220187', 'كتابة الضبط', 'ميناتو تكصيصة', 'المسؤول الإقليمي', 'المديرية الإقليمية وادي الذهب', NOW(), NOW());

INSERT INTO departements (email, phone, name, job, departement, region, created_at, updated_at)
VALUES ('elboayt@gmail.com', '0662122891', 'محمد البويط', 'رئيس المصلحة', 'مصلحة التواصل والشراكة و الشؤون القانونية', 'المديرية الإقليمية وادي الذهب', NOW(), NOW()),
(NULL, '0662121392', 'كركوب الطالب عمر', 'مكتب الشؤون القانونية', 'مصلحة التواصل والشراكة و الشؤون القانونية', 'المديرية الإقليمية وادي الذهب', NOW(), NOW()),
(NULL, '0661063793', 'خديجة التروزي', 'مكتب الشؤون القانونية', 'مصلحة التواصل والشراكة و الشؤون القانونية', 'المديرية الإقليمية وادي الذهب', NOW(), NOW()),
(NULL, '0662128794', 'زكريا الحجوشي', 'مكتب التأمين', 'مصلحة التواصل والشراكة و الشؤون القانونية', 'المديرية الإقليمية وادي الذهب', NOW(), NOW()),
(NULL, '0664528559', 'بويان سليمان', 'مكتب التواصل', 'مصلحة التواصل والشراكة و الشؤون القانونية', 'المديرية الإقليمية وادي الذهب', NOW(), NOW()),
(NULL, '0707100840', 'نجاة بدوش', 'مكتب الشراكة', 'مصلحة التواصل والشراكة و الشؤون القانونية', 'المديرية الإقليمية وادي الذهب', NOW(), NOW());


INSERT INTO departements (email, phone, name, job, departement, region, created_at, updated_at)
VALUES ('boutherrachid25@gmail.com', '0662780035', 'رشيد بوطهير', 'رئيس المصلحة', 'مصلحة الامتحانات', 'المديرية الإقليمية وادي الذهب', NOW(), NOW()),
('rachidoubriche@gmail.com', '0668072399', 'رشيد ابريش', 'مكتب الأرشيف و الرقمنة', 'مصلحة الامتحانات', 'المديرية الإقليمية وادي الذهب', NOW(), NOW());


INSERT INTO departements (email, phone, name, job, departement, region, created_at, updated_at)
VALUES ('mysliman.rafiqe@gmail.com', '0661243789', 'سليمان رفيق', 'رئيس المصلحة', 'مصلحة تاطير المؤسسات التعليمية و التوجيه', 'المديرية الإقليمية وادي الذهب', NOW(), NOW()),
(NULL, '0666015905', 'عزيز موسي', 'مكتب تأطير المؤسسات', 'مصلحة تاطير المؤسسات التعليمية و التوجيه', 'المديرية الإقليمية وادي الذهب', NOW(), NOW()),
(NULL, '0668205061', 'هرناح احمد', 'مكتب التوجيه', 'مصلحة تاطير المؤسسات التعليمية و التوجيه', 'المديرية الإقليمية وادي الذهب', NOW(), NOW()),
(NULL, '0672898067', 'سكينة عليان', 'مكتب التربية غير النظامية', 'مصلحة تاطير المؤسسات التعليمية و التوجيه', 'المديرية الإقليمية وادي الذهب', NOW(), NOW()),
(NULL, '0668120879', 'حورية دحمان', 'مكتب تأطير المؤسسات', 'مصلحة تاطير المؤسسات التعليمية و التوجيه', 'المديرية الإقليمية وادي الذهب', NOW(), NOW());


INSERT INTO departements (email, phone, name, job, departement, region, created_at, updated_at)
VALUES ('rabsiali_1980@hotmail.fr', '0661900108', 'علي رابلسي', 'رئيس المصلحة', 'مصلحة الشؤون التربوية والتخطيط والخريطة المدرسية', 'المديرية الإقليمية وادي الذهب', NOW(), NOW()),
(NULL, '0668119711', 'جمال العلجي', 'مكتب الرياضة المدرسية', 'مصلحة الشؤون التربوية والتخطيط والخريطة المدرسية', 'المديرية الإقليمية وادي الذهب', NOW(), NOW()),
(NULL, '0666972376', 'هدي السلامي', 'مكتب التعليم الاولي', 'مصلحة الشؤون التربوية والتخطيط والخريطة المدرسية', 'المديرية الإقليمية وادي الذهب', NOW(), NOW()),
(NULL, '0662814278', 'اولمدو هشام', 'مكتب الخريطة المدرسية', 'مصلحة الشؤون التربوية والتخطيط والخريطة المدرسية', 'المديرية الإقليمية وادي الذهب', NOW(), NOW()),
(NULL, '0666789216', 'سعداني شماخ', 'مكتب التنظيم التربوي', 'مصلحة الشؤون التربوية والتخطيط والخريطة المدرسية', 'المديرية الإقليمية وادي الذهب', NOW(), NOW()),
('omairinoura@gmail.com', '0666450533', 'نورا عميري', 'مكتب الحياة المدرسية', 'مصلحة الشؤون التربوية والتخطيط والخريطة المدرسية', 'المديرية الإقليمية وادي الذهب', NOW(), NOW());

INSERT INTO departements (email, phone, name, job, departement, region, created_at, updated_at)
VALUES ('bekkali.rachiid@gmail.com', '0661358478', 'رشيد البقالي', 'رئيس المصلحة', 'مصلحة الموارد البشرية والشؤون الإدارية والمالية', 'المديرية الإقليمية وادي الذهب', NOW(), NOW()),
(NULL, '0662123274', 'اركيبي لمهابة', 'مكتب الشؤون الإدارية والمالية', 'مصلحة الموارد البشرية والشؤون الإدارية والمالية', 'المديرية الإقليمية وادي الذهب', NOW(), NOW()),
(NULL, '0661427316', 'بابي امبارك', 'مكتب الشؤون الإدارية والمالية', 'مصلحة الموارد البشرية والشؤون الإدارية والمالية', 'المديرية الإقليمية وادي الذهب', NOW(), NOW()),
(NULL, '0672013689', 'مصطفى بوفوس', 'مكتب الموارد البشرية', 'مصلحة الموارد البشرية والشؤون الإدارية والمالية', 'المديرية الإقليمية وادي الذهب', NOW(), NOW()),
(NULL, '0661428007', 'ممدو السيد', 'مكتب الموارد البشرية', 'مصلحة الموارد البشرية والشؤون الإدارية والمالية', 'المديرية الإقليمية وادي الذهب', NOW(), NOW()),
('lfkirenaimad@gmail.com', '0671803725', 'عيماد افقيران', 'مكتب الممتلكات', 'مصلحة الموارد البشرية والشؤون الإدارية والمالية', 'المديرية الإقليمية وادي الذهب', NOW(), NOW()),
(NULL, '0600846160', 'لمينة ازويكي', 'مكتب الموارد البشرية', 'مصلحة الموارد البشرية والشؤون الإدارية والمالية', 'المديرية الإقليمية وادي الذهب', NOW(), NOW()),
(NULL, '0666352124', 'غزلان ارميثي', 'مكتب الدعم الاجتماعي', 'مصلحة الموارد البشرية والشؤون الإدارية والمالية', 'المديرية الإقليمية وادي الذهب', NOW(), NOW()),
(NULL, '0661887381', 'الشرفة لمام', 'مكتب الأرشيف', 'مصلحة الموارد البشرية والشؤون الإدارية والمالية', 'المديرية الإقليمية وادي الذهب', NOW(), NOW());



INSERT INTO departements (email, phone, name, job, departement, region, created_at, updated_at)
VALUES ('kh.sa69@gmail.com', '0661952134', 'خطري السالكي', 'المدير الإقليمي', 'المسؤول الإقليمي', 'المديرية الإقليمية لأوسرد', NOW(), NOW()),
('echamemiftah@gmail.com', '0661925224', 'محمد أمين خزراجي', 'رئيس مصلحة تأطير المؤسسات والتوجيه', 'مصلحة تاطير المؤسسات التعليمية و التوجيه', 'المديرية الإقليمية لأوسرد', NOW(), NOW()),
('khezrajiamin@gmail.com', '0662495796', 'مفتاح شام', 'رئيس مصلحة الشؤون التربوية والخريطة المدرسية والتخطيط', 'مصلحة الشؤون التربوية والتخطيط والخريطة المدرسية','المديرية الإقليمية لأوسرد', NOW(), NOW()),
('profhamid@gmail.com', '0662892555', 'حميد البو', 'رئيس المركز الاقليمي للامتحانات', 'مصلحة الامتحانات', 'المديرية الإقليمية لأوسرد', NOW(), NOW()),
('larabas.tet@gmail.com', '0666846501', 'اشبيهن ماء العينين لارباس', 'رئيس الشؤون القانونية والتواصل والشراكة', 'مصلحة التواصل والشراكة و الشؤون القانونية', 'المديرية الإقليمية لأوسرد', NOW(), NOW()),
('maicanem@gmail.com', '0662123264', 'أمبارك ميشان', 'رئيس مصلحة تدبير الموارد البشرية والشؤون الإدارية و المالية', 'مصلحة الموارد البشرية والشؤون الإدارية والمالية', 'المديرية الإقليمية لأوسرد', NOW(), NOW());


-- this part is for the ambassadeur data to be inserted in the database

INSERT INTO ambassadeurs (fullname, zone, email, phone, note, region, created_at, updated_at)
VALUES ('احمد فال الكنتي', '1', NULL, '0670860216', NULL, 'هيئة التوجيه التربوي لوادي الذهب', NOW(), NOW()),
('طارق الغراف', '2', NULL, '0666303225', NULL, 'هيئة التوجيه التربوي لوادي الذهب', NOW(), NOW()),
('احمد بطاح', '3', NULL, '0678190410', NULL, 'هيئة التوجيه التربوي لوادي الذهب', NOW(), NOW()),
('عبد العاطي بايا', '4', NULL, '0661590415', NULL, 'هيئة التوجيه التربوي لوادي الذهب', NOW(), NOW()),
('محمد بري', '5', NULL, '0662539410', NULL, 'هيئة التوجيه التربوي لوادي الذهب', NOW(), NOW()),
('خالد كليل', '6', NULL, '0662559087', NULL, 'هيئة التوجيه التربوي لوادي الذهب', NOW(), NOW()),
('باسو اوراغ', '7', NULL, '0672647673', NULL, 'هيئة التوجيه التربوي لوادي الذهب', NOW(), NOW()),
('سعاد الدبار', '8', NULL, '0672373376', NULL, 'هيئة التوجيه التربوي لوادي الذهب', NOW(), NOW());



INSERT INTO ambassadeurs (fullname, zone, email, phone, note, region, created_at, updated_at)
VALUES ('عبد العاطي بايا', 'جميع المؤسسات التعليمية بالإقليم', NULL, '0661590415','تكليف بالمديرية', 'هيئة التوجيه التربوي لأوسرد', NOW(), NOW());

-- this part is for the ambassadeur data to be inserted in the database
