-- Active: 1710095898738@@127.0.0.1@3306@academia
-- this is very private data so don't use it for something bad
















-- nothing

















-- nothing

use academia;

INSERT INTO departements (email, phone, job, name, departement, region, created_at, updated_at)
VALUES ('ahmedkourrad@gmail.com', '0662120867', 'المدير الإقليمي', 'احمد كراد', 'المسؤول الإقليمي', 'المديرية الإقليمية وادي الذهب', NOW(), NOW()),
(NULL, '0662795088', 'الكتابة الخاصة', 'عمر بوزاكا', 'المسؤول الإقليمي', 'المديرية الإقليمية وادي الذهب', NOW(), NOW()),
('ezzounktif@gmail.com', '0666342269', 'الكتابة التقنية', 'فتيحة الزونكطي', 'المسؤول الإقليمي', 'المديرية الإقليمية وادي الذهب', NOW(), NOW()),
('sk.elhafidi@gmail.com', '0666436886', 'منظومة الاعلام', 'سكينة الحافظي', 'المسؤول الإقليمي', 'المديرية الإقليمية وادي الذهب', NOW(), NOW()),
('lachguer477@gmail.com', '0662122985', 'كتابة الضبط', 'نعيمة لشكر', 'المسؤول الإقليمي', 'المديرية الإقليمية وادي الذهب', NOW(), NOW()),
(NULL, '0662780462', 'كتابة الضبط', 'فوزية ايت تمست', 'المسؤول الإقليمي', 'المديرية الإقليمية وادي الذهب', NOW(), NOW()),
(NULL, '0662760355', 'كتابة الضبط', 'مريم كركور', 'المسؤول الإقليمي', 'المديرية الإقليمية وادي الذهب', NOW(), NOW()),
(NULL, '0668220187', 'كتابة الضبط', 'ميناتو تكصيصة', 'المسؤول الإقليمي', 'المديرية الإقليمية وادي الذهب', NOW(), NOW());

INSERT INTO departements (email, phone, name, job, departement, region, created_at, updated_at)
VALUES ('elboayt@gmail.com', '0662122891', 'محمد البويط', 'رئيس المصلحة', 'مصلحة التواصل والشراكة و الشؤون القانونية', 'المديرية الإقليمية وادي الذهب', NOW(), NOW()),
(NULL, '0662121392', 'كركوب الطالب عمر', 'مكتب الشؤون القانونية', 'مصلحة التواصل والشراكة و الشؤون القانونية', 'المديرية الإقليمية وادي الذهب', NOW(), NOW()),
(NULL, '0661063793', 'خديجة التروزي', 'مكتب الشؤون القانونية', 'مصلحة التواصل والشراكة و الشؤون القانونية', 'المديرية الإقليمية وادي الذهب', NOW(), NOW()),
(NULL, '0662128794', 'زكريا الحجوشي', 'مكتب التأمين', 'مصلحة التواصل والشراكة و الشؤون القانونية', 'المديرية الإقليمية وادي الذهب', NOW(), NOW()),
(NULL, '0664528559', 'بويان سليمان', 'مكتب التواصل', 'مصلحة التواصل والشراكة و الشؤون القانونية', 'المديرية الإقليمية وادي الذهب', NOW(), NOW()),
(NULL, '0707100840', 'نجاة بدوش', 'مكتب الشراكة', 'مصلحة التواصل والشراكة و الشؤون القانونية', 'المديرية الإقليمية وادي الذهب', NOW(), NOW());


INSERT INTO departements (email, phone, name, job, departement, region, created_at, updated_at)
VALUES ('boutherrachid25@gmail.com', '0662780035', 'رشيد بوطهير', 'رئيس المصلحة', 'مصلحة الامتحانات', 'المديرية الإقليمية وادي الذهب', NOW(), NOW()),
('rachidoubriche@gmail.com', '0668072399', 'رشيد ابريش', 'مكتب الأرشيف و الرقمنة', 'مصلحة الامتحانات', 'المديرية الإقليمية وادي الذهب', NOW(), NOW());


INSERT INTO departements (email, phone, name, job, departement, region, created_at, updated_at)
VALUES ('mysliman.rafiqe@gmail.com', '0661243789', 'سليمان رفيق', 'رئيس المصلحة', 'مصلحة تاطير المؤسسات التعليمية و التوجيه', 'المديرية الإقليمية وادي الذهب', NOW(), NOW()),
(NULL, '0666015905', 'عزيز موسي', 'مكتب تأطير المؤسسات', 'مصلحة تاطير المؤسسات التعليمية و التوجيه', 'المديرية الإقليمية وادي الذهب', NOW(), NOW()),
(NULL, '0668205061', 'هرناح احمد', 'مكتب التوجيه', 'مصلحة تاطير المؤسسات التعليمية و التوجيه', 'المديرية الإقليمية وادي الذهب', NOW(), NOW()),
(NULL, '0672898067', 'سكينة عليان', 'مكتب التربية غير النظامية', 'مصلحة تاطير المؤسسات التعليمية و التوجيه', 'المديرية الإقليمية وادي الذهب', NOW(), NOW()),
(NULL, '0668120879', 'حورية دحمان', 'مكتب تأطير المؤسسات', 'مصلحة تاطير المؤسسات التعليمية و التوجيه', 'المديرية الإقليمية وادي الذهب', NOW(), NOW());


INSERT INTO departements (email, phone, name, job, departement, region, created_at, updated_at)
VALUES ('rabsiali_1980@hotmail.fr', '0661900108', 'علي رابلسي', 'رئيس المصلحة', 'مصلحة الشؤون التربوية والتخطيط والخريطة المدرسية', 'المديرية الإقليمية وادي الذهب', NOW(), NOW()),
(NULL, '0668119711', 'جمال العلجي', 'مكتب الرياضة المدرسية', 'مصلحة الشؤون التربوية والتخطيط والخريطة المدرسية', 'المديرية الإقليمية وادي الذهب', NOW(), NOW()),
(NULL, '0666972376', 'هدي السلامي', 'مكتب التعليم الاولي', 'مصلحة الشؤون التربوية والتخطيط والخريطة المدرسية', 'المديرية الإقليمية وادي الذهب', NOW(), NOW()),
(NULL, '0662814278', 'اولمدو هشام', 'مكتب الخريطة المدرسية', 'مصلحة الشؤون التربوية والتخطيط والخريطة المدرسية', 'المديرية الإقليمية وادي الذهب', NOW(), NOW()),
(NULL, '0666789216', 'سعداني شماخ', 'مكتب التنظيم التربوي', 'مصلحة الشؤون التربوية والتخطيط والخريطة المدرسية', 'المديرية الإقليمية وادي الذهب', NOW(), NOW()),
('omairinoura@gmail.com', '0666450533', 'نورا عميري', 'مكتب الحياة المدرسية', 'مصلحة الشؤون التربوية والتخطيط والخريطة المدرسية', 'المديرية الإقليمية وادي الذهب', NOW(), NOW());

INSERT INTO departements (email, phone, name, job, departement, region, created_at, updated_at)
VALUES ('bekkali.rachiid@gmail.com', '0661358478', 'رشيد البقالي', 'رئيس المصلحة', 'مصلحة الموارد البشرية والشؤون الإدارية والمالية', 'المديرية الإقليمية وادي الذهب', NOW(), NOW()),
(NULL, '0662123274', 'اركيبي لمهابة', 'مكتب الشؤون الإدارية والمالية', 'مصلحة الموارد البشرية والشؤون الإدارية والمالية', 'المديرية الإقليمية وادي الذهب', NOW(), NOW()),
(NULL, '0661427316', 'بابي امبارك', 'مكتب الشؤون الإدارية والمالية', 'مصلحة الموارد البشرية والشؤون الإدارية والمالية', 'المديرية الإقليمية وادي الذهب', NOW(), NOW()),
(NULL, '0672013689', 'مصطفى بوفوس', 'مكتب الموارد البشرية', 'مصلحة الموارد البشرية والشؤون الإدارية والمالية', 'المديرية الإقليمية وادي الذهب', NOW(), NOW()),
(NULL, '0661428007', 'ممدو السيد', 'مكتب الموارد البشرية', 'مصلحة الموارد البشرية والشؤون الإدارية والمالية', 'المديرية الإقليمية وادي الذهب', NOW(), NOW()),
('lfkirenaimad@gmail.com', '0671803725', 'عيماد افقيران', 'مكتب الممتلكات', 'مصلحة الموارد البشرية والشؤون الإدارية والمالية', 'المديرية الإقليمية وادي الذهب', NOW(), NOW()),
(NULL, '0600846160', 'لمينة ازويكي', 'مكتب الموارد البشرية', 'مصلحة الموارد البشرية والشؤون الإدارية والمالية', 'المديرية الإقليمية وادي الذهب', NOW(), NOW()),
(NULL, '0666352124', 'غزلان ارميثي', 'مكتب الدعم الاجتماعي', 'مصلحة الموارد البشرية والشؤون الإدارية والمالية', 'المديرية الإقليمية وادي الذهب', NOW(), NOW()),
(NULL, '0661887381', 'الشرفة لمام', 'مكتب الأرشيف', 'مصلحة الموارد البشرية والشؤون الإدارية والمالية', 'المديرية الإقليمية وادي الذهب', NOW(), NOW());


-- ALTER TABLE departements ADD COLUMN region VARCHAR(255) AFTER departement;

-- ALTER TABLE departements DROP COLUMN region;



INSERT INTO departements (email, phone, name, job, departement, region, created_at, updated_at)
VALUES ('kh.sa69@gmail.com', '0661952134', 'خطري السالكي', 'المدير الإقليمي', 'المسؤول الإقليمي', 'المديرية الإقليمية لأوسرد', NOW(), NOW()),
('echamemiftah@gmail.com', '0661925224', 'محمد أمين خزراجي', 'رئيس مصلحة تأطير المؤسسات والتوجيه', 'مصلحة تاطير المؤسسات التعليمية و التوجيه', 'المديرية الإقليمية لأوسرد', NOW(), NOW()),
('khezrajiamin@gmail.com', '0662495796', 'مفتاح شام', 'رئيس مصلحة الشؤون التربوية والخريطة المدرسية والتخطيط', 'مصلحة الشؤون التربوية والتخطيط والخريطة المدرسية','المديرية الإقليمية لأوسرد', NOW(), NOW()),
('profhamid@gmail.com', '0662892555', 'حميد البو', 'رئيس المركز الاقليمي للامتحانات', 'مصلحة الامتحانات', 'المديرية الإقليمية لأوسرد', NOW(), NOW()),
('larabas.tet@gmail.com', '0666846501', 'اشبيهن ماء العينين لارباس', 'رئيس الشؤون القانونية والتواصل والشراكة', 'مصلحة التواصل والشراكة و الشؤون القانونية', 'المديرية الإقليمية لأوسرد', NOW(), NOW()),
('maicanem@gmail.com', '0662123264', 'أمبارك ميشان', 'رئيس مصلحة تدبير الموارد البشرية والشؤون الإدارية و المالية', 'مصلحة الموارد البشرية والشؤون الإدارية والمالية', 'المديرية الإقليمية لأوسرد', NOW(), NOW());

-- delete from departements where departement = 'رئيس مصلحة تأطير المؤسسات والتوجيه' and region = 'المديرية الإقليمية لأوسرد';

-- INSERT INTO departements (email, phone, name, job, departement, region, created_at, updated_at)
-- VALUES ('kh.sa69@gmail.com', '0661952134', 'خطري السالكي', 'المدير الإقليمي', 'المسؤول الإقليمي', 'المديرية الإقليمية لأوسرد', NOW(), NOW())
;
-- select * from departements where departement = 'المسؤول الإقليمي' and region = 'المديرية الإقليمية لأوسرد';

-- SELECT DISTINCT departement from departements GROUP BY departement;


-- this part is for the ambassadeur data to be inserted in the database

INSERT INTO ambassadeurs (fullname, zone, email, phone, note, region, created_at, updated_at)
VALUES ('احمد فال الكنتي', '1', NULL, '0670860216', NULL, 'هيئة التوجيه التربوي لوادي الذهب', NOW(), NOW()),
('طارق الغراف', '2', NULL, '0666303225', NULL, 'هيئة التوجيه التربوي لوادي الذهب', NOW(), NOW()),
('احمد بطاح', '3', NULL, '0678190410', NULL, 'هيئة التوجيه التربوي لوادي الذهب', NOW(), NOW()),
('عبد العاطي بايا', '4', NULL, '0661590415', NULL, 'هيئة التوجيه التربوي لوادي الذهب', NOW(), NOW()),
('محمد بري', '5', NULL, '0662539410', NULL, 'هيئة التوجيه التربوي لوادي الذهب', NOW(), NOW()),
('خالد كليل', '6', NULL, '0662559087', NULL, 'هيئة التوجيه التربوي لوادي الذهب', NOW(), NOW()),
('باسو اوراغ', '7', NULL, '0672647673', NULL, 'هيئة التوجيه التربوي لوادي الذهب', NOW(), NOW()),
('سعاد الدبار', '8', NULL, '0672373376', NULL, 'هيئة التوجيه التربوي لوادي الذهب', NOW(), NOW());



INSERT INTO ambassadeurs (fullname, zone, email, phone, note, region, created_at, updated_at)
VALUES ('عبد العاطي بايا', 'جميع المؤسسات التعليمية بالإقليم', NULL, '0661590415','تكليف بالمديرية', 'هيئة التوجيه التربوي لأوسرد', NOW(), NOW());

-- this part is for the ambassadeur data to be inserted in the database

-- this part is for the inspection data to be inserted in the database

INSERT INTO inspections (region, section, specialisation, inspecteur_name, telephone, email) VALUES
('هيئة التفتيش التربوي لوادي الذهب', 'الابتدائي', 'اللغة العربية', 'الخليل العولة', '0661841315/0661843860', NULL),
('هيئة التفتيش التربوي لوادي الذهب', 'الابتدائي', 'اللغة العربية', 'صفاء هاشمي', '0666938453', NULL),
('هيئة التفتيش التربوي لوادي الذهب', 'الابتدائي', 'اللغة العربية', 'حميد بوعدي', '0662123155', NULL),
('هيئة التفتيش التربوي لوادي الذهب', 'الابتدائي', 'الفرنسية', 'عصام مربوح', '0666499229', NULL),
('هيئة التفتيش التربوي لوادي الذهب', 'الابتدائي', 'الفرنسية', 'حسن اكضي', '0678512911', NULL),
('هيئة التفتيش التربوي لوادي الذهب', 'الابتدائي', 'الفرنسية', 'سعيد الفطواكي', '0661423488', NULL),
('هيئة التفتيش التربوي لوادي الذهب', 'الثانوي', 'التربية الإسلامية', 'محمد الادريسي', '0617176017', NULL),
('هيئة التفتيش التربوي لوادي الذهب', 'الثانوي', 'اللغة الإنجليزية', 'السعدية الورقي', '0627656550', NULL),
('هيئة التفتيش التربوي لوادي الذهب', 'الثانوي', 'الاعلاميات', 'حسن سلخي', '0672896736', NULL),
('هيئة التفتيش التربوي لوادي الذهب', 'الثانوي', 'الاقتصاد و التدبير', 'هدى الفلكي', NULL, NULL),
('هيئة التفتيش التربوي لوادي الذهب', 'الثانوي', 'التكنولوجيا الصناعية', 'عبد النبي اقتيب', '0662799336', NULL),
('هيئة التفتيش التربوي لوادي الذهب', 'الثانوي', 'التكنولوجيا الكهربائية', 'انس القاسمي', NULL, NULL),
('هيئة التفتيش التربوي لوادي الذهب', 'الثانوي', 'التربية البدنية', 'مولاي الشريف البحري', '0661436478', NULL),
('هيئة التفتيش التربوي لوادي الذهب', 'الثانوي', 'التربية البدنية', 'أمين بنعباس', '0668233674', NULL),
('هيئة التفتيش التربوي لوادي الذهب', 'الثانوي', 'الفرنسية', 'زكريا اليحياوي', '0666782991', NULL),
('هيئة التفتيش التربوي لوادي الذهب', 'الثانوي', 'الفرنسية', 'حكيم فهيم', '0610850261', NULL),
('هيئة التفتيش التربوي لوادي الذهب', 'الثانوي', 'الاجتماعيات', 'مبارك اسبع', '0666178043', NULL),
('هيئة التفتيش التربوي لوادي الذهب', 'الثانوي', 'الاجتماعيات', 'ياسين الحناصي', NULL, NULL),
('هيئة التفتيش التربوي لوادي الذهب', 'الثانوي', 'الفيزياء و الكيمياء', 'عبد الوهاب التاقي', '0666089269', NULL),
('هيئة التفتيش التربوي لوادي الذهب', 'الثانوي', 'الفيزياء و الكيمياء', 'الداودي الفاطمي', '0698969199', NULL),
('هيئة التفتيش التربوي لوادي الذهب', 'الثانوي', 'علوم الحياة و الأرض', 'محمد بلعيادي', '0662775840', NULL),
('هيئة التفتيش التربوي لوادي الذهب', 'الثانوي', 'علوم الحياة و الأرض', 'زهير أشواق', NULL, NULL),
('هيئة التفتيش التربوي لوادي الذهب', 'الثانوي', 'علوم الحياة و الأرض', 'ميلود شكيت', '0678877912', NULL),
('هيئة التفتيش التربوي لوادي الذهب', 'الثانوي', 'اللغة العربية', 'محمد لحرير', '0662802097', NULL),
('هيئة التفتيش التربوي لوادي الذهب', 'الثانوي', 'اللغة العربية', 'إسماعيل الهموني', NULL, NULL),
('هيئة التفتيش التربوي لوادي الذهب', 'الثانوي', 'اللغة العربية', 'سناء ادمالك', '0662123342/0671831431', NULL),
('هيئة التفتيش التربوي لوادي الذهب', 'الثانوي', 'الفلسفة', 'طارق زائير', NULL, NULL),
('هيئة التفتيش التربوي لوادي الذهب', 'الثانوي', 'الفلسفة', 'الحسين اخدوش', '0668782547', NULL),
('هيئة التفتيش التربوي لوادي الذهب', 'الثانوي', 'الفلسفة', 'الحسن الافراني', NULL, NULL),
('هيئة التفتيش التربوي لوادي الذهب', 'الثانوي', 'الرياضيات', 'عبد اللطيف صبور', '0666984304', NULL),
('هيئة التفتيش التربوي لوادي الذهب', 'الثانوي', 'الرياضيات', 'العلمي العمراوي', '0662769319/0662769319', NULL),
('هيئة التفتيش التربوي لوادي الذهب', 'الثانوي', 'الرياضيات', 'عبد الغني السكراتي', NULL, NULL),
('هيئة التفتيش التربوي لوادي الذهب', 'الثانوي', 'المصالح المادية و المالية', 'محمد الحماموشي', '0661286946', NULL),
('هيئة التفتيش التربوي لوادي الذهب', 'الثانوي', 'المصالح المادية و المالية', 'محمد الغلى', NULL, NULL),
('هيئة التفتيش التربوي لوادي الذهب', 'الثانوي', 'المصالح المادية و المالية', 'رشيد الصالحي', NULL, NULL),
('هيئة التفتيش التربوي لوادي الذهب', 'الثانوي', 'التوجيه التربوي', 'إباهيم آيت خويا', '0661939552', NULL),
('هيئة التفتيش التربوي لوادي الذهب', 'الثانوي', 'التوجيه التربوي', 'محمد الدبشي', '0613031499', NULL);





INSERT INTO inspections (region, section, specialisation, inspecteur_name, telephone, email) VALUES
('هيئة التفتيش التربوي لأوسرد', 'الابتدائي', 'التعليم الابتدائي', 'نصرتهم فكا الله', '0666214496', 'narsa.insp.d.o.e@gmail.com'),
('هيئة التفتيش التربوي لأوسرد', 'الثانوي', 'التربية البدنية', 'أشرف وشنا', '0601854454', 'achrafouchna@gmail,com'),
('هيئة التفتيش التربوي لأوسرد', 'المديرية الإقليمية', 'المصالح المادية و المالية', 'عبد المنعم سدار', '0666328421', 'abesaddar@gmail.com'),
('هيئة التفتيش التربوي لأوسرد', 'المديرية الإقليمية', 'التوجيه التربوي', 'خالد ركيبة', '0661997488', 'khalide.rkiba@gmail.com');


-- this part is for the inspection data to be inserted in the database

