-- etablissement.sql

use academia


INSERT INTO etablissements (Institution_name, directeur_name, directeur_number, directeur_email, association_president, association_number)
VALUES 
('م.الشهداء الابتدائية', 'مصطفى بالمدني', '0662121169', 'mustapha.belmadani@taalim.ma', NULL, NULL),
('م.لكلات الابتدائية', 'نادية بيدوني', '0662859189', 'baidouni.nadiar@gmail.com', 'بوسيف ركيبية', '0690085413'),
('م.الشريف الادريسي', 'محمد موزيك', '0661788101', 'prim.charifedrissi@gmail.com', 'رشيد غلاب', '0670799183'),
('م.ابن زهر الابتدائية', 'عبد العزيز تريكية', '0667990312', 'rimadam2004@hotmail.com', NULL, NULL),
('م.الفضيلة الابتدائية', 'محمد بلهي', '0668115173', 'mohamedballihi1976@gmail.com', 'لحبيب نجيح', '0668812690'),
('م.وادي الشياف', 'رشيد شدود', '0666706794', 'ecoleouedchiaf@gmail.com', 'عبد القادر السيفر', '0631284049'),
('م.يوسف بن تاشفين', 'الحبيب الحجوجي', '0661903278', 'elhjouji1963@gmail.com', 'العيادي محمد', '0661219836'),
('م.محمد الخامس', 'يوسف بريئ', '0668227632', 'youssefbari09@gmail.com', 'خطري بلاوي', '0661992963'),
('م.ام التونسي', 'المصطفى مسلكة', '0661925779', 'mstphmslg2@gmail.com', 'محمد عالي اليتيم', '0667331340'),
('م.عبد الكريم الخطابي', 'صالح سامي الصلح', '0667854571', 'essoulhsalah.sami@taalim.ma', 'عمار عبد الكبير', '0767493788'),
('م.كم', 'زهور لمنور', '0667765205', 'zou.lamnouar@gmail.com', 'محمد بلحوس', '0677611246'),
('م.مولاي الحسن', 'محمد ديداح', '0666379832', 'myelhassan@gmail.com', 'سكينة الإدريسي', '0667126168'),
('م.عبد الله ولد باهيا', 'عبد العزيز لغزاوي', '0672228127', 'abdelaziz.lghzaoui675@gmail.com', 'فتيحة بلمومن', '0646756433'),
('م.المختار السوسي', 'محمد جموع', '0668176793', 'jemmouahmed.64@gmail.com', 'عبد الفتاح فضالي', '0676030206'),
('م.تاورطة', 'جواد طلوك', '0662051865', 'jawad.tallouk@taalim.ma', 'عبد النبي باعقيل', '0668945707'),
('م.الوحدة', 'حسن توفيقي', '0661924211', 'hassanabouyahya9@gmail.com', 'ميمونتنا ماءلعينين', '0666053699'),
('م.المسيرة الخضراء', 'مولاي خليل عبدلاوي', '0666458946', 'khalidabdel10@gmail.com', 'فاتح الله العرش', '0678745286'),
('م.الداخلة', 'عبد القادر شعير', '0667410255', 'abdelkaderchaair@gmail.com', 'نجاة منوار', '0666846412'),
('م.ابن منظور', 'عبدالله جبران', '0662121506', 'abdellahjabran@gmail.com', 'رشيد بورحيم', '0668643928'),
('م.النهضة', 'مولاي الحسين العلوي', '0662123851', 'alaouihoussain707@gmail.com', 'محمد عدو', '0668256400'),
('م.العركوب', 'الحسين البقالي', '0662828988', 'argoubecole022@gmail.com', NULL, NULL),
('م.المعالي', 'عزيز فضالي', '0666537996', 'azizfaidali07@gmail.com', 'نعيمة المشوط', '0601716628'),
('م.بئر كندوز', 'لبنى ادرعي', '0662112242', 'loloubna2@gmail.com', 'هشام العقاد', '0661787233'),
('الثانوية الإعدادية الحي الجديد', 'خديجة حما', '0667275233', 'hammakhadija80@gmail.com', 'محمد سالم عسكران ', '0661652990'),
('الثانوية الإعدادية وادي الذهب', 'محمد العسري', '0661936107', 'mohamed1968laasri@gmail.com', 'رشيد معطى الله', '0661857408'),
('الثانوية الإعدادية ابن طفيل', 'رضوان رحالي', '0662191848', 'ridouanerahhali@gmail.com', 'عادل لمزوضي', '0661245842'),
('الثانوية الإعدادية الحسن الثاني', 'عبد الرحمان السالمي', '0661902258', 'es.salmy1@gmail.com', 'عمر ادريوش', '0667396821'),
('الثانوية الإعدادية المنار', 'الحسين حريش', '0662083997', 'lahoucineehrich1980@gmail.com', 'محمد أهل بوجمعة', '0642636440'),
('الثانوية الإعدادية الفرابي', 'سميرة كرسيت', '0667990312', 'kersit.samira27@gmail.com', 'بشرة الحاجب', '0771645708'),
('ثانوية الوحدة الإعدادية', 'عمر اشود', '0668115173', 'farabicolege@gmail.com', 'سميرة كرسيت', '0667990312'),
('ثانوية الخليج', 'مبارك تودة', '0668227632', 'toudda.elmobarec@taalim.ma', 'عبد الجليل الزيداني', '0662121169'),
('ثانوية محمد السادس', 'المختار بلاح', '0661925779', 'ballah75elmokhtar@gmail.com', 'شزين بغوس', '0666379832'),
('ثانوية ابن رشد', 'بوشعيب كرطوع', '0667854571', 'gartoua.1970@gmail.com', 'بوشعيب كرطوع', '0667854571'),
('ثانوية الامام مالك', 'عبد الله الزوبير', '0667765205', 'lyceehdak@gmail.com', 'عبدالله لفداوي', '0671758387'),
('ثانوية الفتح', 'شزين بغوس', '0666379832', 'cherin.baghous@gmail.com', 'السباعي محمد', '0666148361'),
('ثانوية تيرس التاهيلية', 'حمدي الرابح', '0672228127', 'errabeh.hamdi@gmail.com', 'محمد سالم عسكران', '0661652990'),
('ثانوية النصر', 'الحسين بعوي', '0662859189', 'khawarizmi.almodir@gmail.com', 'حسن لشهب', '0678701941'),
('مركز عقبة بن نافع', 'اعلي الطرنيش', '0661903278', 'doubian01@hotmail.fr', NULL, NULL)
;