-- inspections data

use academia;



INSERT INTO inspections (region, section, specialisation, inspecteur_name, telephone, email) VALUES
('هيئة التفتيش التربوي لوادي الذهب', 'الابتدائي', 'اللغة العربية', 'الخليل العولة', '0661841315/0661843860', NULL),
('هيئة التفتيش التربوي لوادي الذهب', 'الابتدائي', 'اللغة العربية', 'صفاء هاشمي', '0666938453', NULL),
('هيئة التفتيش التربوي لوادي الذهب', 'الابتدائي', 'اللغة العربية', 'حميد بوعدي', '0662123155', NULL),
('هيئة التفتيش التربوي لوادي الذهب', 'الابتدائي', 'الفرنسية', 'عصام مربوح', '0666499229', NULL),
('هيئة التفتيش التربوي لوادي الذهب', 'الابتدائي', 'الفرنسية', 'حسن اكضي', '0678512911', NULL),
('هيئة التفتيش التربوي لوادي الذهب', 'الابتدائي', 'الفرنسية', 'سعيد الفطواكي', '0661423488', NULL),
('هيئة التفتيش التربوي لوادي الذهب', 'الثانوي', 'التربية الإسلامية', 'محمد الادريسي', '0617176017', NULL),
('هيئة التفتيش التربوي لوادي الذهب', 'الثانوي', 'اللغة الإنجليزية', 'السعدية الورقي', '0627656550', NULL),
('هيئة التفتيش التربوي لوادي الذهب', 'الثانوي', 'الاعلاميات', 'حسن سلخي', '0672896736', NULL),
('هيئة التفتيش التربوي لوادي الذهب', 'الثانوي', 'الاقتصاد و التدبير', 'هدى الفلكي', NULL, NULL),
('هيئة التفتيش التربوي لوادي الذهب', 'الثانوي', 'التكنولوجيا الصناعية', 'عبد النبي اقتيب', '0662799336', NULL),
('هيئة التفتيش التربوي لوادي الذهب', 'الثانوي', 'التكنولوجيا الكهربائية', 'انس القاسمي', NULL, NULL),
('هيئة التفتيش التربوي لوادي الذهب', 'الثانوي', 'التربية البدنية', 'مولاي الشريف البحري', '0661436478', NULL),
('هيئة التفتيش التربوي لوادي الذهب', 'الثانوي', 'التربية البدنية', 'أمين بنعباس', '0668233674', NULL),
('هيئة التفتيش التربوي لوادي الذهب', 'الثانوي', 'الفرنسية', 'زكريا اليحياوي', '0666782991', NULL),
('هيئة التفتيش التربوي لوادي الذهب', 'الثانوي', 'الفرنسية', 'حكيم فهيم', '0610850261', NULL),
('هيئة التفتيش التربوي لوادي الذهب', 'الثانوي', 'الاجتماعيات', 'مبارك اسبع', '0666178043', NULL),
('هيئة التفتيش التربوي لوادي الذهب', 'الثانوي', 'الاجتماعيات', 'ياسين الحناصي', NULL, NULL),
('هيئة التفتيش التربوي لوادي الذهب', 'الثانوي', 'الفيزياء و الكيمياء', 'عبد الوهاب التاقي', '0666089269', NULL),
('هيئة التفتيش التربوي لوادي الذهب', 'الثانوي', 'الفيزياء و الكيمياء', 'الداودي الفاطمي', '0698969199', NULL),
('هيئة التفتيش التربوي لوادي الذهب', 'الثانوي', 'علوم الحياة و الأرض', 'محمد بلعيادي', '0662775840', NULL),
('هيئة التفتيش التربوي لوادي الذهب', 'الثانوي', 'علوم الحياة و الأرض', 'زهير أشواق', NULL, NULL),
('هيئة التفتيش التربوي لوادي الذهب', 'الثانوي', 'علوم الحياة و الأرض', 'ميلود شكيت', '0678877912', NULL),
('هيئة التفتيش التربوي لوادي الذهب', 'الثانوي', 'اللغة العربية', 'محمد لحرير', '0662802097', NULL),
('هيئة التفتيش التربوي لوادي الذهب', 'الثانوي', 'اللغة العربية', 'إسماعيل الهموني', NULL, NULL),
('هيئة التفتيش التربوي لوادي الذهب', 'الثانوي', 'اللغة العربية', 'سناء ادمالك', '0662123342/0671831431', NULL),
('هيئة التفتيش التربوي لوادي الذهب', 'الثانوي', 'الفلسفة', 'طارق زائير', NULL, NULL),
('هيئة التفتيش التربوي لوادي الذهب', 'الثانوي', 'الفلسفة', 'الحسين اخدوش', '0668782547', NULL),
('هيئة التفتيش التربوي لوادي الذهب', 'الثانوي', 'الفلسفة', 'الحسن الافراني', NULL, NULL),
('هيئة التفتيش التربوي لوادي الذهب', 'الثانوي', 'الرياضيات', 'عبد اللطيف صبور', '0666984304', NULL),
('هيئة التفتيش التربوي لوادي الذهب', 'الثانوي', 'الرياضيات', 'العلمي العمراوي', '0662769319/0662769319', NULL),
('هيئة التفتيش التربوي لوادي الذهب', 'الثانوي', 'الرياضيات', 'عبد الغني السكراتي', NULL, NULL),
('هيئة التفتيش التربوي لوادي الذهب', 'الثانوي', 'المصالح المادية و المالية', 'محمد الحماموشي', '0661286946', NULL),
('هيئة التفتيش التربوي لوادي الذهب', 'الثانوي', 'المصالح المادية و المالية', 'محمد الغلى', NULL, NULL),
('هيئة التفتيش التربوي لوادي الذهب', 'الثانوي', 'المصالح المادية و المالية', 'رشيد الصالحي', NULL, NULL),
('هيئة التفتيش التربوي لوادي الذهب', 'الثانوي', 'التوجيه التربوي', 'إباهيم آيت خويا', '0661939552', NULL),
('هيئة التفتيش التربوي لوادي الذهب', 'الثانوي', 'التوجيه التربوي', 'محمد الدبشي', '0613031499', NULL);





INSERT INTO inspections (region, section, specialisation, inspecteur_name, telephone, email) VALUES
('هيئة التفتيش التربوي لأوسرد', 'الابتدائي', 'التعليم الابتدائي', 'نصرتهم فكا الله', '0666214496', 'narsa.insp.d.o.e@gmail.com'),
('هيئة التفتيش التربوي لأوسرد', 'الثانوي', 'التربية البدنية', 'أشرف وشنا', '0601854454', 'achrafouchna@gmail,com'),
('هيئة التفتيش التربوي لأوسرد', 'المديرية الإقليمية', 'المصالح المادية و المالية', 'عبد المنعم سدار', '0666328421', 'abesaddar@gmail.com'),
('هيئة التفتيش التربوي لأوسرد', 'المديرية الإقليمية', 'التوجيه التربوي', 'خالد ركيبة', '0661997488', 'khalide.rkiba@gmail.com');

-- this is for the inspection database to be inserted in the database